#define _CRT_SECURE_NO_WARNNINGS
#include <stdio.h>



int main()
{
	//sub0(); //배열
	//sub1(); //구구단
	//sub2(); //문자열 길이
	//sub3(); //3차원 배열
	//sub4(); //포인터
	//sub5(); //포인터로 문자열 처리
	//sub6(); //포인터배열
	//sub7(); //포인터사용
	//sub8(); //점연산자
	//sub9(); //재귀호출
	//sub10(); //하노이탑
	//sub11(); //원소의 논리,물리 순서
	//sub12(); //다항식
	//sub13(); //단순연결 리스트
	//sub14(); //단방향연결 리스트
	//sub15(); // 양방향 연결 리스트
	//sub16(); //원형 연결 리스트
	//sub17(); //스택
	//sub18(); // 스택 포인터
	//sub19(); // 큐
	//sub20(); // 큐 포인터
	//sub21(); // 순차탐색
	//sub22(); // 이진탐색
	//sub23(); // 삽입정렬
	//sub24(); // 선택정렬
	//sub25(); // 퀵 정렬
	//sub26(); // 퀵 정렬2
	//sub27(); // 이진트리
	//sub28(); // 이진트리탐색
 
	return 0;
}